```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.external.git: Refreshing state... [id=-]
module.bootstrap.module.aws_organization.random_string.random: Refreshing state... [id=eon6]
module.bootstrap.module.aws_organization.aws_organizations_account.account: Refreshing state... [id=289441844927]
module.bootstrap.module.serverless_api["example"].module.repository.github_repository.repository: Refreshing state... [id=serverless-example-api]
module.bootstrap.module.aws_logging.data.aws_region.current: Refreshing state... [id=us-east-1]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_role.cloudformation: Refreshing state... [id=serverless-example-api-cloudformation]
module.bootstrap.module.aws_logging.data.aws_caller_identity.current: Refreshing state... [id=2020-10-13 02:33:27.184022076 +0000 UTC]
module.bootstrap.module.aws_logging.data.aws_partition.current: Refreshing state... [id=2020-10-13 02:33:27.216780612 +0000 UTC]
module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.cloudformation: Refreshing state... [id=3853530454]
module.bootstrap.module.aws_api_gateway.aws_iam_role.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch]
module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.deployer: Refreshing state... [id=1350816066]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user.user: Refreshing state... [id=serverless-example-api-deployer]
module.bootstrap.module.aws_logging.data.aws_iam_policy_document.bucket_policy: Refreshing state... [id=4027875105]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.policy: Refreshing state... [id=serverless-example-api-deployer:base-policy]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_access_key.access_key: Refreshing state... [id=AKIAUGZAUB27QHM5VREI]
module.bootstrap.module.aws_api_gateway.aws_iam_role_policy.api_gateway_cloudwatch: Refreshing state... [id=api-gateway-cloudwatch:default]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_role_policy.cloudformation_policy: Refreshing state... [id=serverless-example-api-cloudformation:base-policy]
module.bootstrap.module.serverless_api["example"].module.aws_iam.data.aws_iam_policy_document.assume_cloudformation_role: Refreshing state... [id=1982985735]
module.bootstrap.module.serverless_api["example"].module.aws_iam.aws_iam_user_policy.assume_cloudformation_role: Refreshing state... [id=serverless-example-api-deployer:assume-cloudformation-role]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.bootstrap.module.aws_api_gateway.aws_api_gateway_account.account will be created
  + resource "aws_api_gateway_account" "account" {
      + cloudwatch_role_arn = "arn:aws:iam::289441844927:role/api-gateway-cloudwatch"
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # module.bootstrap.module.aws_logging.aws_cloudtrail.cloudtrail will be created
  + resource "aws_cloudtrail" "cloudtrail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = true
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + kms_key_id                    = (known after apply)
      + name                          = "cloudtrail"
      + s3_bucket_name                = "scaffoldly-eon6-logs-cloudtrail"

      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::S3::Object"
              + values = [
                  + "arn:aws:s3:::",
                ]
            }
        }
      + event_selector {
          + include_management_events = true
          + read_write_type           = "All"

          + data_resource {
              + type   = "AWS::Lambda::Function"
              + values = [
                  + "arn:aws:lambda",
                ]
            }
        }
    }

  # module.bootstrap.module.aws_logging.aws_kms_key.cloudtrail will be created
  + resource "aws_kms_key" "cloudtrail" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = "cloudtrail"
      + enable_key_rotation      = false
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Id        = "CloudTrail key policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::289441844927:root",
                              + "arn:aws:iam::289441844927:role/BootstrapAccessRole",
                            ]
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = "kms:GenerateDataKey*"
                      + Condition = {
                          + StringLike = {
                              + kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:289441844927:trail/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudTrail to encrypt logs"
                    },
                  + {
                      + Action    = "kms:DescribeKey"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow CloudTrail to describe key"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:ReEncryptFrom",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = "289441844927"
                            }
                          + StringLike   = {
                              + kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:289441844927:trail/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow principals in the account to decrypt log files"
                    },
                  + {
                      + Action    = "kms:CreateAlias"
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = "289441844927"
                              + kms:ViaService    = "ec2.us-east-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow alias creation during setup"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:ReEncryptFrom",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + kms:CallerAccount = "289441844927"
                            }
                          + StringLike   = {
                              + kms:EncryptionContext:aws:cloudtrail:arn = "arn:aws:cloudtrail:*:289441844927:trail/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable cross account log decryption"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.bootstrap.module.aws_logging.aws_s3_bucket.logs will be created
  + resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "scaffoldly-eon6-logs-cloudtrail"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + noncurrent_version_transition {
              + days          = 180
              + storage_class = "DEEP_ARCHIVE"
            }
          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + noncurrent_version_transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.bootstrap.module.aws_logging.aws_s3_bucket_policy.bucket_policy will be created
  + resource "aws_s3_bucket_policy" "bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::scaffoldly-eon6-logs-cloudtrail/AWSLogs/289441844927/*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::scaffoldly-eon6-logs-cloudtrail"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.bootstrap.module.aws_logging.aws_s3_bucket_public_access_block.logs will be created
  + resource "aws_s3_bucket_public_access_block" "logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.bootstrap.module.dns.aws_route53_delegation_set.main will be created
  + resource "aws_route53_delegation_set" "main" {
      + id           = (known after apply)
      + name_servers = (known after apply)
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["live"].aws_api_gateway_domain_name.domain will be created
  + resource "aws_api_gateway_domain_name" "domain" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = (known after apply)
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = "TLS_1_2"

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["live"].aws_route53_record.api_record will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["nonlive"].aws_api_gateway_domain_name.domain will be created
  + resource "aws_api_gateway_domain_name" "domain" {
      + arn                     = (known after apply)
      + certificate_arn         = (known after apply)
      + certificate_upload_date = (known after apply)
      + cloudfront_domain_name  = (known after apply)
      + cloudfront_zone_id      = (known after apply)
      + domain_name             = (known after apply)
      + id                      = (known after apply)
      + regional_domain_name    = (known after apply)
      + regional_zone_id        = (known after apply)
      + security_policy         = "TLS_1_2"

      + endpoint_configuration {
          + types = (known after apply)
        }
    }

  # module.bootstrap.module.aws_api_gateway.module.domain["nonlive"].aws_route53_record.api_record will be created
  + resource "aws_route53_record" "api_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.apex will be created
  + resource "aws_acm_certificate" "apex" {
      + arn                       = (known after apply)
      + domain_name               = "scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffold.ly"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffold.ly"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_route53_record.verification_record["scaffold.ly"] will be created
  + resource "aws_route53_record" "verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.bootstrap.module.dns.module.dns["live"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = (known after apply)
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffold.ly"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.apex will be created
  + resource "aws_acm_certificate" "apex" {
      + arn                       = (known after apply)
      + domain_name               = "scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_acm_certificate.subdomain_wildcard will be created
  + resource "aws_acm_certificate" "subdomain_wildcard" {
      + arn                       = (known after apply)
      + domain_name               = "*.scaffoldly.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.scaffoldly.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_route53_record.verification_record["scaffoldly.dev"] will be created
  + resource "aws_route53_record" "verification_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.bootstrap.module.dns.module.dns["nonlive"].aws_route53_zone.zone will be created
  + resource "aws_route53_zone" "zone" {
      + comment           = "Managed by Terraform"
      + delegation_set_id = (known after apply)
      + force_destroy     = false
      + id                = (known after apply)
      + name              = "scaffoldly.dev"
      + name_servers      = (known after apply)
      + zone_id           = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = "289441844927"
      + arn        = "arn:aws:sts::289441844927:assumed-role/BootstrapAccessRole/1602556836500797023"
      + id         = "2020-10-13 02:40:36.963398631 +0000 UTC"
      + user_id    = "AROAUGZAUB27QUJGU6CBP:1602556836500797023"
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix = "amazonaws.com"
      + id         = "2020-10-13 02:40:36.926210886 +0000 UTC"
      + partition  = "aws"
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "lambda/live/serverless-example-api"
      + name_prefix             = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].aws_secretsmanager_secret_version.value will be created
  + resource "aws_secretsmanager_secret_version" "value" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_access_key will be created
  + resource "github_actions_secret" "deployer_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_account_id will be created
  + resource "github_actions_secret" "deployer_aws_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_partition will be created
  + resource "github_actions_secret" "deployer_aws_partition" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_PARTITION"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_rest_api_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_REST_API_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_rest_api_root_resource_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_root_resource_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_REST_API_ROOT_RESOURCE_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["live"].github_actions_secret.deployer_aws_secret_key will be created
  + resource "github_actions_secret" "deployer_aws_secret_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "LIVE_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = "289441844927"
      + arn        = "arn:aws:sts::289441844927:assumed-role/BootstrapAccessRole/1602556836500797023"
      + id         = "2020-10-13 02:40:36.963447031 +0000 UTC"
      + user_id    = "AROAUGZAUB27QUJGU6CBP:1602556836500797023"
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].data.aws_partition.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_partition" "current"  {
      + dns_suffix = "amazonaws.com"
      + id         = "2020-10-13 02:40:36.926054585 +0000 UTC"
      + partition  = "aws"
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].aws_secretsmanager_secret.secret will be created
  + resource "aws_secretsmanager_secret" "secret" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "lambda/nonlive/serverless-example-api"
      + name_prefix             = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
      + rotation_lambda_arn     = (known after apply)

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].aws_secretsmanager_secret_version.value will be created
  + resource "aws_secretsmanager_secret_version" "value" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_access_key will be created
  + resource "github_actions_secret" "deployer_aws_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_account_id will be created
  + resource "github_actions_secret" "deployer_aws_account_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_ACCOUNT_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_partition will be created
  + resource "github_actions_secret" "deployer_aws_partition" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_PARTITION"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_rest_api_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_REST_API_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_rest_api_root_resource_id will be created
  + resource "github_actions_secret" "deployer_aws_rest_api_root_resource_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_REST_API_ROOT_RESOURCE_ID"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.secrets["nonlive"].github_actions_secret.deployer_aws_secret_key will be created
  + resource "github_actions_secret" "deployer_aws_secret_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless-example-api"
      + secret_name     = "NONLIVE_AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = (known after apply)
      + base_path   = "example"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage_name  = "live"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date      = (known after apply)
      + execution_arn     = (known after apply)
      + id                = (known after apply)
      + invoke_url        = (known after apply)
      + rest_api_id       = (known after apply)
      + stage_description = "A basic stage created to remediate a race condition in API Gateway"
      + stage_name        = "bootstrap"
      + triggers          = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_gateway_response.response_cors will be created
  + resource "aws_api_gateway_gateway_response" "response_cors" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Headers" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_integration_response.health_get_response_200 will be created
  + resource "aws_api_gateway_integration_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = ""
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_response.health_get_response_200 will be created
  + resource "aws_api_gateway_method_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "live"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "example-live"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "live"
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.access_logs_group will be created
  + resource "aws_cloudwatch_log_group" "access_logs_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-live-access-logs"
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.execution_group will be created
  + resource "aws_cloudwatch_log_group" "execution_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].aws_cloudwatch_log_group.group will be created
  + resource "aws_cloudwatch_log_group" "group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-live"
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_base_path_mapping.mapping will be created
  + resource "aws_api_gateway_base_path_mapping" "mapping" {
      + api_id      = (known after apply)
      + base_path   = "example"
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage_name  = "nonlive"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date      = (known after apply)
      + execution_arn     = (known after apply)
      + id                = (known after apply)
      + invoke_url        = (known after apply)
      + rest_api_id       = (known after apply)
      + stage_description = "A basic stage created to remediate a race condition in API Gateway"
      + stage_name        = "bootstrap"
      + triggers          = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_gateway_response.response_cors will be created
  + resource "aws_api_gateway_gateway_response" "response_cors" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Headers" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods" = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration.health_get will be created
  + resource "aws_api_gateway_integration" "health_get" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_integration_response.health_get_response_200 will be created
  + resource "aws_api_gateway_integration_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = ""
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method.health_get will be created
  + resource "aws_api_gateway_method" "health_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_response.health_get_response_200 will be created
  + resource "aws_api_gateway_method_response" "health_get_response_200" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_method_settings.settings will be created
  + resource "aws_api_gateway_method_settings" "settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "nonlive"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = true
          + logging_level                              = "INFO"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_resource.health will be created
  + resource "aws_api_gateway_resource" "health" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "health"
      + rest_api_id = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source           = "HEADER"
      + arn                      = (known after apply)
      + created_date             = (known after apply)
      + execution_arn            = (known after apply)
      + id                       = (known after apply)
      + minimum_compression_size = -1
      + name                     = "example-nonlive"
      + root_resource_id         = (known after apply)

      + endpoint_configuration {
          + types            = (known after apply)
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_api_gateway_stage.stage will be created
  + resource "aws_api_gateway_stage" "stage" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "nonlive"
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = "$context.identity.sourceIp $context.identity.caller $context.identity.user [$context.requestTime] \"$context.httpMethod $context.resourcePath $context.protocol\" $context.status $context.responseLength $context.requestId"
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.access_logs_group will be created
  + resource "aws_cloudwatch_log_group" "access_logs_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-nonlive-access-logs"
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.execution_group will be created
  + resource "aws_cloudwatch_log_group" "execution_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].aws_cloudwatch_log_group.group will be created
  + resource "aws_cloudwatch_log_group" "group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/apigateway/example-nonlive"
      + retention_in_days = 0
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base"  {
      + id      = "3454387480"
      + json    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:List*",
                          + "dynamodb:Describe*",
                          + "dynamodb:*Item*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:dynamodb:*:*:table/live-serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version = "2012-10-17"

      + statement {
          + actions       = [
              + "cloudwatch:PutMetricData",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "dynamodb:*Item*",
              + "dynamodb:Describe*",
              + "dynamodb:List*",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:dynamodb:*:*:table/live-serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-example-api-live"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["live"].module.iam.aws_iam_role_policy.base will be created
  + resource "aws_iam_role_policy" "base" {
      + id     = (known after apply)
      + name   = "base"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:List*",
                          + "dynamodb:Describe*",
                          + "dynamodb:*Item*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:dynamodb:*:*:table/live-serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:*:secretsmanager:*:*:secret:lambda/live/serverless-example-api*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "serverless-example-api-live"
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.data.aws_iam_policy_document.base will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "base"  {
      + id      = "704701628"
      + json    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:List*",
                          + "dynamodb:Describe*",
                          + "dynamodb:*Item*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + version = "2012-10-17"

      + statement {
          + actions       = [
              + "cloudwatch:PutMetricData",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "*",
            ]
        }
      + statement {
          + actions       = [
              + "dynamodb:*Item*",
              + "dynamodb:Describe*",
              + "dynamodb:List*",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*",
            ]
        }
      + statement {
          + actions       = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect        = "Allow"
          + not_actions   = []
          + not_resources = []
          + resources     = [
              + "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*",
            ]
        }
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless-example-api-nonlive"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.bootstrap.module.serverless_api["example"].module.stage["nonlive"].module.iam.aws_iam_role_policy.base will be created
  + resource "aws_iam_role_policy" "base" {
      + id     = (known after apply)
      + name   = "base"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:List*",
                          + "dynamodb:Describe*",
                          + "dynamodb:*Item*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:*:dynamodb:*:*:table/nonlive-serverless-example-api*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:*:secretsmanager:*:*:secret:lambda/nonlive/serverless-example-api*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "serverless-example-api-nonlive"
    }

Plan: 67 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

\n\n0
```